----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  G:\Mi unidad\4_DOCENCIA\Taller de Stata\2020-II\4 - Clases\Clase 1 - IntroducciÃ³n
>  importaciÃ³n y descripciÃ³n de datos\bitacora_C1_importacion.log
  log type:  text
 opened on:  11 Aug 2020, 04:08:18

. cd "G:\Mi unidad\4_DOCENCIA\Taller de Stata\2020-II\4 - Clases\Clase 1 - IntroducciÃ³n import
> aciÃ³n y descripciÃ³n de datos" 
G:\Mi unidad\4_DOCENCIA\Taller de Stata\2020-II\4 - Clases\Clase 1 - IntroducciÃ³n importaciÃ³n 
> y descripciÃ³n de datos

. dir // Â¿Que hay en la carpeta?
  <dir>   8/11/20  4:08  .                 
  <dir>   8/10/20 21:19  ..                
  11.1k   8/11/20  4:08  bitacora_C1.log   
   7.5k   8/11/20  4:07  Do_C1.do          
  26.2k   2/09/11  8:48  NBI_1993.csv      
  26.2k   1/21/10  8:26  NBI_1993.txt      
  64.3k   8/17/11  9:03  NBI_1993.xlsx     
  97.4k   1/29/18 18:21  NBI_2011.xlsx     
   7.7k   2/06/18 16:34  notas.dta         
   3.1k   8/11/20  4:08  notas_def.dta     
2735.9k   5/17/16 18:37  cabeceras_dane_2012.dbf
  79.7k   8/10/20 23:59  TALLER DE STATA.pptx
   0.6k   8/11/20  4:08  bitacora_C1_importacion.log
   0.2k   8/10/20 10:22  desktop.ini       

. 
. * 1 Archivo Excel
. import excel "NBI_2011", describe  

          Sheet | Range
  --------------+--------------
     Municipios | A1:G1127
  Departamentos | A1:E39

. import excel "NBI_2011.xlsx", clear // Si se tiene un archivo de Excel con varias hojas y no
>  se especifica la opciÃ³n sheet ,Stata toma la primera hoja 
(7 vars, 1,127 obs)

. import excel "NBI_2011.xlsx", sheet("Municipios") cellrange(A5:G1127) firstrow clear
(7 vars, 1,122 obs)

. 
. * 2 Archivos de texto (.csv - .txt)
. 
. * 2.1 Separado por comas(.csv)
. type NBI_1993.csv, lines(20)
cod_dpto,cod_mpio,Municipios,NBI
11,001,Bogotá,17.28
91,001,Leticia,50.07
91,263,CD. El Encanto,100.00
91,405,CD. La Chorrera,100.00
91,407,CD. La Pedrera,100.00
91,430,CD. La Victoria1,100.00
91,460,CD. Miriti-Parana,100.00
91,530,CD.Puerto Alegría2,100.00
91,536,CD. Puerto Arica3,100.00
91,540,Puerto Nariño,100.00
91,669,CD. Puerto Santander,100.00
91,798,CD. Tarapaca,100.00
05,001,Medellín,16.08
05,002,Abejorral,43.61
05,004,Abriaqui,45.56
05,021,Alejandría,56.46
05,030,Amaga,31.66
05,031,Amalfi,53.79
05,034,Andes,36.82
. 
. import delimited "NBI_1993.csv", delimiter(comma) clear 
(4 vars, 1,131 obs)

. import delimited "NBI_1993", delimiter(comma) rowrange(1:1001)   stringcols(1 2)  clear //pe
> rmite ajustar el nÃºmero de columnas o variables. No es necesario colocar la extensiÃ³n, por d
> efecto es .csv
(4 vars, 1,000 obs)

. 
. * 2.2 Separado por espacio(.txt)
. type NBI_1993.txt, lines(20)
cod_dpto        cod_mpio        Municipios      NBI
11      001     Bogotá  17.28
91      001     Leticia 50.07
91      263     CD. El Encanto  100.00
91      405     CD. La Chorrera 100.00
91      407     CD. La Pedrera  100.00
91      430     CD. La Victoria1        100.00
91      460     CD. Miriti-Parana       100.00
91      530     CD.Puerto Alegría2      100.00
91      536     CD. Puerto Arica3       100.00
91      540     Puerto Nariño   100.00
91      669     CD. Puerto Santander    100.00
91      798     CD. Tarapaca    100.00
05      001     Medellín        16.08
05      002     Abejorral       43.61
05      004     Abriaqui        45.56
05      021     Alejandría      56.46
05      030     Amaga   31.66
05      031     Amalfi  53.79
05      034     Andes   36.82
. 
. import delimited "NBI_1993.txt", delimiter(tab) clear stringcols(1 2)
(4 vars, 1,131 obs)

. 
. * 3 Archivo dbf
. 
. import dbase "cabeceras_dane_2012.dbf", clear
(30 vars, 1,114 obs)

. 
. * 4 IntroducciÃ³n directa de datos
.  clear

.  input var1 var2 

          var1       var2
  1.   1 2 
  2.   3 4 
  3.   5 6
  4.  end

. log close
      name:  <unnamed>
       log:  G:\Mi unidad\4_DOCENCIA\Taller de Stata\2020-II\4 - Clases\Clase 1 - IntroducciÃ³n
>  importaciÃ³n y descripciÃ³n de datos\bitacora_C1_importacion.log
  log type:  text
 closed on:  11 Aug 2020, 04:08:19
----------------------------------------------------------------------------------------------
